ams/src/Reports/AMS_ПлатежнаяДисциплинаКлиентов/AMS_ПлатежнаяДисциплинаКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>AMS_ПлатежнаяДисциплинаКлиентов</name>
</mdclass:Report>

ams/src/AccumulationRegisters/РасчетыСКлиентами/РасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКлиентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КОплате</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Оплачивается</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Отгружается</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплатуКлиенту</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродажаПоЗаказу</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистратора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <comment>Заполняется для реализации товаров и услуг</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключатьПриКонтроле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимаяСуммаЗадолженности</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗалогЗаТару</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОперации</name>
    <comment>Используется в распределении расчетов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗачетаПоДатеПлатежа</name>
    <comment>Используется в распределении расчетов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОплаты</name>
    <type>
      <types>EnumRef.ВариантыКонтроляОплатыКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовПриемник</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаПоПартнерамПриемник</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПриемник</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПриемник</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДаннымОбъектаРасчетовИсточника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияВзаиморасчетов</name>
    <type>
      <types>EnumRef.ОперацииВзаиморасчетов</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ams/src/Reports/AMS_ПлатежнаяДисциплинаКлиентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	КлючВарианта = НеОпределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("КлючВарианта", КлючВарианта);
	
	СКД = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = СКД.ВариантыНастроек.Найти(КлючВарианта).Настройки;
	
	Если КлючВарианта = "ДисциплинаКлиентов" Тогда 
		ПоказатьТаблицуКлиентов(ДокументРезультат,ДанныеРасшифровки,СКД,Настройки);
		
	ИначеЕсли КлючВарианта = "ДисциплинаКлиента" Тогда
		Если  КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Количество() = 0 Тогда 
			ПоказатьТаблицуКлиентаПрограммно(ДокументРезультат,ДанныеРасшифровки,СКД,Настройки);
			
		Иначе
			ПоказатьТаблицуКлиентаИнтерактивно(ДокументРезультат,ДанныеРасшифровки,СКД,Настройки);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПоказатьТаблицуКлиентов(ДокументРезультат,ДанныеРасшифровки,СКД,Настройки)
	// Получить Идентификаторы отборов пользовательских настроек
	ПараметрПериодОтчета = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
	
	ОтборПартнер       = Новый ПолеКомпоновкиДанных("Партнер");
	ОтборГруппаДоступа = Новый ПолеКомпоновкиДанных("ГруппаДоступа");
	ОтборБизнесРегион  = Новый ПолеКомпоновкиДанных("БизнесРегион");
	
	ИдентификаторыОтборов = Новый Структура;
	Элементы = Настройки.Отбор.Элементы;
	Для  Каждого Элемент Из Элементы Цикл
		Если Элемент.ЛевоеЗначение = ОтборПартнер Тогда 
			ИдентификаторыОтборов.Вставить("Партнер",Элемент.ИдентификаторПользовательскойНастройки);
	    КонецЕсли;
		Если Элемент.ЛевоеЗначение = ОтборГруппаДоступа Тогда 
			ИдентификаторыОтборов.Вставить("ГруппаДоступа",Элемент.ИдентификаторПользовательскойНастройки);
	    КонецЕсли;
		Если Элемент.ЛевоеЗначение = ОтборБизнесРегион Тогда 
			ИдентификаторыОтборов.Вставить("БизнесРегион",Элемент.ИдентификаторПользовательскойНастройки);
	    КонецЕсли;
    КонецЦикла;	
	
	// Получить Значение пользовательских настроек
	ПериодОтчета  = Неопределено;
	Партнер       = Неопределено;
	ГруппаДоступа = Неопределено;
	БизнесРегион  = Неопределено;
	
	Элементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Для  Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Элемент.Параметр = ПараметрПериодОтчета И Элемент.Использование Тогда
				ПериодОтчета = Элемент.Значение;
	    	КонецЕсли;
				
		ИначеЕсли ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторыОтборов.Партнер И Элемент.Использование Тогда
			     Партнер = Элемент.ПравоеЗначение;
			КонецЕсли;
			Если Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторыОтборов.ГруппаДоступа И Элемент.Использование Тогда
			     ГруппаДоступа = Элемент.ПравоеЗначение;
			КонецЕсли;
			Если Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторыОтборов.БизнесРегион И Элемент.Использование Тогда
			     БизнесРегион = Элемент.ПравоеЗначение;
			КонецЕсли;
	    КонецЕсли;
    КонецЦикла;	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Ссылка КАК Партнер
	|ИЗ
	|	Справочник.Партнеры КАК т
	|ГДЕ
	|	НЕ т.ПометкаУдаления
	|	И т.Клиент";
	
	СписокПартнеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Партнер");
		
	ТаблицаРеализаций = ПолучитьТаблицуРеализаций(ПериодОтчета,СписокПартнеров);
	
	Если ПериодОтчета <> Неопределено Тогда 
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета",ПериодОтчета);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Партнер", Партнер, ВидСравненияКомпоновкиДанных.ВСписке,, Партнер<>Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "ГруппаДоступа", ГруппаДоступа, ВидСравненияКомпоновкиДанных.Равно,, ГруппаДоступа<>Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "БизнесРегион", БизнесРегион, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии,, БизнесРегион<>Неопределено);
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаРеализаций",ТаблицаРеализаций);
	мср.ПолучитьДанныеНаОснованииСКД(СКД,ДокументРезультат,Настройки,Неопределено,ДанныеРасшифровки,,ВнешниеНаборыДанных);
КонецПроцедуры

Процедура ПоказатьТаблицуКлиентаПрограммно(ДокументРезультат,ДанныеРасшифровки,СКД,Настройки)
	ПериодОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение;
	Партнер      = КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение;
	
	ТаблицаРеализаций = ПолучитьТаблицуРеализаций(ПериодОтчета,Партнер);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета",ПериодОтчета);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Партнер", Партнер, ВидСравненияКомпоновкиДанных.Равно,, Партнер<>Неопределено);
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаРеализаций",ТаблицаРеализаций);
	мср.ПолучитьДанныеНаОснованииСКД(СКД,ДокументРезультат,Настройки,Неопределено,ДанныеРасшифровки,,ВнешниеНаборыДанных);
КонецПроцедуры

Процедура ПоказатьТаблицуКлиентаИнтерактивно(ДокументРезультат,ДанныеРасшифровки,СКД,Настройки)
	ПараметрПериодОтчета = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
	
	ОтборПартнер = Новый ПолеКомпоновкиДанных("Партнер");
	
	ИдентификаторыОтборов = Новый Структура;
	Элементы = Настройки.Отбор.Элементы;
	Для  Каждого Элемент Из Элементы Цикл
		Если Элемент.ЛевоеЗначение = ОтборПартнер Тогда 
			ИдентификаторыОтборов.Вставить("Партнер",Элемент.ИдентификаторПользовательскойНастройки);
	    КонецЕсли;
    КонецЦикла;	
	
	// Получить Значение пользовательских настроек
	ПериодОтчета  = Неопределено;
	Партнер       = Неопределено;
	
	Элементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Для  Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Элемент.Параметр = ПараметрПериодОтчета Тогда
				ПериодОтчета = Элемент.Значение;
	    	КонецЕсли;
				
		ИначеЕсли ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторыОтборов.Партнер И Элемент.Использование Тогда
			     Партнер = Элемент.ПравоеЗначение;
			КонецЕсли;
	    КонецЕсли;
    КонецЦикла;	
	
	ТаблицаРеализаций = ПолучитьТаблицуРеализаций(ПериодОтчета,Партнер);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета",ПериодОтчета);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Партнер", Партнер, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Партнер));
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаРеализаций",ТаблицаРеализаций);
	мср.ПолучитьДанныеНаОснованииСКД(СКД,ДокументРезультат,Настройки,Неопределено,ДанныеРасшифровки,,ВнешниеНаборыДанных);
КонецПроцедуры

Функция ПолучитьТаблицуРеализаций(Период,СписокПартнеров)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала"     , ?(Период=Неопределено,'20130101',Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания"  , ?(Период=Неопределено,ТекущаяДатаСеанса(),Период.ДатаОкончания));
	Запрос.УстановитьПараметр("СписокПартнеров", СписокПартнеров);
	Запрос.УстановитьПараметр("ТекущаяДата"    , ТекущаяДатаСеанса());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	д.Партнер КАК Партнер,
	|	д.Ссылка КАК Реализация,
	|	НАЧАЛОПЕРИОДА(д.Дата, ДЕНЬ) КАК ДатаДокумента,
	|	МАКСИМУМ(т.ДатаПлатежа) КАК ДатаПлатежа
	|ПОМЕСТИТЬ док
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ЭтапыГрафикаОплаты КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д.Проведен
	|	И д.Дата >= &ДатаНачала
	|	И д.Партнер В (&СписокПартнеров)
	|СГРУППИРОВАТЬ ПО
	|	д.Партнер,
	|	д.Ссылка,
	|	НАЧАЛОПЕРИОДА(д.Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	док.Партнер КАК Партнер,
	|	МАКСИМУМ(док.ДатаДокумента) КАК ДатаДокумента
	|ПОМЕСТИТЬ вт1
	|ИЗ
	|	док КАК док
	|ГДЕ
	|	док.ДатаПлатежа <= &ДатаОкончания
	|СГРУППИРОВАТЬ ПО
	|	док.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	док.Партнер КАК Партнер,
	|	РАЗНОСТЬДАТ(МАКСИМУМ(док.ДатаДокумента), МАКСИМУМ(док.ДатаПлатежа), ДЕНЬ) КАК Отсрочка
	|ПОМЕСТИТЬ отс
	|ИЗ
	|	док КАК док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт1 КАК вт1
	|		ПО док.Партнер = вт1.Партнер
	|		И док.ДатаДокумента = вт1.ДатаДокумента
	|СГРУППИРОВАТЬ ПО
	|	док.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.ОбъектРасчетов КАК Реализация,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(т.Период, ДЕНЬ)) КАК ДатаОплаты
	|ПОМЕСТИТЬ плата
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК т
	|ГДЕ
	|	т.ОбъектРасчетов В
	|		(ВЫБРАТЬ
	|			т.Реализация КАК Реализация
	|		ИЗ
	|			док КАК т)
	|	И т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
	|СГРУППИРОВАТЬ ПО
	|	т.ОбъектРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	р.ОбъектРасчетов КАК Реализация,
	|	р.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ ост
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(, ОбъектРасчетов В
	|		(ВЫБРАТЬ
	|			т.Реализация КАК Реализация
	|		ИЗ
	|			док КАК т)) КАК р
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	д.ДокументОснование КАК Реализация,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(д.Дата, ДЕНЬ)) КАК ДатаКорректировки
	|ПОМЕСТИТЬ корр
	|ИЗ
	|	Документ.КорректировкаРеализации КАК д
	|ГДЕ
	|	д.ДокументОснование В
	|		(ВЫБРАТЬ
	|			т.Реализация КАК Реализация
	|		ИЗ
	|			док КАК т)
	|СГРУППИРОВАТЬ ПО
	|	д.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	док.Партнер КАК Партнер,
	|	док.Реализация КАК Реализация,
	|	док.ДатаПлатежа КАК ДатаПлатежа,
	|	ВЫБОР
	|		КОГДА корр.ДатаКорректировки ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ корр.ДатаКорректировки
	|	КОНЕЦ КАК ДатаКорректировки,
	|	плата.ДатаОплаты КАК ДатаОплаты,
	|	ВЫБОР
	|		КОГДА ост.Сумма ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ост.Сумма
	|	КОНЕЦ КАК Сумма,
	|	отс.Отсрочка КАК Отсрочка
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	док КАК док
	|		ЛЕВОЕ СОЕДИНЕНИЕ плата КАК плата
	|		ПО док.Реализация = плата.Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ корр КАК корр
	|		ПО док.Реализация = корр.Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ост КАК ост
	|		ПО док.Реализация = ост.Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ отс КАК отс
	|		ПО док.Партнер = отс.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	п.ГруппаДоступа КАК ГруппаДоступа,
	|	п.БизнесРегион КАК БизнесРегион,
	|	вт.Партнер КАК Партнер,
	|	вт.Реализация КАК Реализация,
	|	вт.ДатаПлатежа КАК ДатаПлатежа,
	|	вт.ДатаКорректировки КАК ДатаКорректировки,
	|	ВЫБОР
	|		КОГДА вт.Сумма > 0
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ вт.ДатаОплаты
	|	КОНЕЦ КАК ДатаОплаты,
	|	вт.Сумма КАК Сумма,
	|	вт.Отсрочка КАК Отсрочка,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|			КОГДА вт.Сумма > 0
	|				ТОГДА РАЗНОСТЬДАТ(вт.ДатаПлатежа, &ТекущаяДата, ДЕНЬ)
	|			ИНАЧЕ РАЗНОСТЬДАТ(вт.ДатаПлатежа, вт.ДатаОплаты, ДЕНЬ)
	|		КОНЕЦ < 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|			КОГДА вт.Сумма > 0
	|				ТОГДА РАЗНОСТЬДАТ(вт.ДатаПлатежа, &ТекущаяДата, ДЕНЬ)
	|			ИНАЧЕ РАЗНОСТЬДАТ(вт.ДатаПлатежа, вт.ДатаОплаты, ДЕНЬ)
	|		КОНЕЦ
	|	КОНЕЦ КАК Просрочено
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК п
	|		ПО вт.Партнер = п.Ссылка
	|ГДЕ
	|	вт.ДатаПлатежа <= &ДатаОкончания
	|	ИЛИ вт.ДатаОплаты <= &ДатаОкончания";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

#КонецЕсли
